# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

m = input("Введите трехзначное число: ")

a = int(m[0])
b = int(m[1])
c = int(m[2])

print (f"Сумма цифр числа равна: {a + b + c} ")